<?
/* ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
	┃ 사용자 정의 변수 모음																																							 ┃
	┃ 업데이트:2012.01.10																																								 ┃
	┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛*/
	ini_set('error_reporting', !E_NOTICE & !E_WARNING);

	define("br", "<br>" );
	define("THIS", dirname(__FILE__) );
	define("ROOT", $_SERVER['DOCUMENT_ROOT'] );

	#사이트 환경 정보
//	$SITE_INFO=db_select("select * from tbl_site_config");
	$SITE_INFO[manager]=	'admin';

	#맴버정보
//	$userno = anti_injection($_SESSION[USER][LOGIN_NO]);
//	if($userno){
//		$member = db_select("select idx, ifnull(pno,'x')pno, ifnull(email,'x')email, reg_date, visit_date, uname, member_level from tbl_member a where idx='$userno'");
//	}

	//마스터 관리자
	$MASTER_UID = "admin";
//	$MASTER_IP = "221.150.126.75";

	//페이징 함수
	$page_first_page="<img src=\"/images/paging_prev.png\" />";
	$page_post_start="<img src=\"/images/paging_prev.png\" />";
	$page_next_start="<img src=\"/images/paging_next.png\" />";
	$page_last_page="<img src=\"/images/paging_next.png\" />";

	if(!$list_num) $list_num=10;
	if(!$page_num) $page_num=10;
	$start_num=($page-1)*$list_num;

	//사이트 경로 설정
	$DOCUMENT_ROOT=$_SERVER['DOCUMENT_ROOT']; //루트경로
	$return_url=$_SERVER['REQUEST_URI'];
	$current_url=urlencode("http://".$_SERVER['HTTP_HOST'].$_SERVER['REQUEST_URI']); //현재페이지 경로

	//페이스북 정보
	$facebook_appId = "817312122265200"; // App를 등록하고 나면 알수 있는 App ID
	$facebook_secret = "f6dda4330cdfab52563c504a6748cb35"; // App를 등록하고 나면 알수 있는 App Secret

	//트위터 정보
	$consumer_key = "OeZWVPgnDOmKBvrcZc53yRDa3"; // App를 등록하고 나면 알수 있는 App ID
	$consumer_secret = "cpg6cGuyjgwEKgCEFGd8k5cLpNdOQwf9Mol8houcHDckJbOhE4"; // App를 등록하고 나면 알수 있는 App Secret

	// naver
	$naver_clientid = "HCjIWH9ei5q1rz8cTXrd";
	$naver_secret = "DpQlFXYRz0";

	// kakao
	$kakao_clientid = "b785408c23e7a46264de69457d58989a";
	$kakao_secret = "7JWfpm3GHS1r4obZj0OmGMZ8dQPGzfYO";

	$folder=explode("/",$_SERVER['PHP_SELF']);

/* ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
			┃ 사용자 정의 배열 모음																																							 ┃
			┃ 업데이트:2012.01.10																																								 ┃
			┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛*/

			$deny_ip = array("");
			array_push($deny_ip, '1.229.54.189');
			array_push($deny_ip, '1.250.71.144');
			array_push($deny_ip, '10.8.116.6');
			array_push($deny_ip, '119.198.172.173');
			array_push($deny_ip, '122.32.204.39');
			array_push($deny_ip, '122.35.43.3');
			array_push($deny_ip, '122.42.211.53');
			array_push($deny_ip, '124.111.66.176');
			array_push($deny_ip, '124.60.42.192');
			array_push($deny_ip, '124.63.77.117');
			array_push($deny_ip, '124.63.85.114');
			array_push($deny_ip, '14.50.188.154');
			array_push($deny_ip, '175.119.87.45');
			array_push($deny_ip, '175.127.162.81');
			array_push($deny_ip, '175.206.5.210');
			array_push($deny_ip, '211.196.105.7');
			array_push($deny_ip, '211.210.7.5');
			array_push($deny_ip, '211.49.211.150');
			array_push($deny_ip, '218.239.179.197');
			array_push($deny_ip, '39.119.143.20');
			array_push($deny_ip, '49.163.136.14');
			array_push($deny_ip, '58.121.40.104');
			array_push($deny_ip, '59.15.127.52');
			array_push($deny_ip, '59.9.242.158');
			array_push($deny_ip, '61.101.57.45');
			array_push($deny_ip, '61.34.132.221');

		## 이메일
		$emailArray=array(
			"naver.com"=>"네이버",
			"nate.com"=>"네이트",
			"hanmail.net"=>"한메일",
			"gmail.com"=>"지메일",
			"yahoo.com"=>"야후",
			"dreamwiz.com"=>"드림위즈",
			"empal.com"=>"엠파스",
			"freechal.com"=>"프리첼",
			"hanafos.com"=>"하나포스",
			"hanmir.com"=>"한미르",
			"hitel.net"=>"하이텔",
			"hotmail.com"=>"핫메일",
			"korea.com"=>"코리아닷컴",
			"lycos.co.kr"=>"라이코스",
			"netian.com"=>"네띠앙",
			"paran.com"=>"파란",
			"yahoo.co.kr"=>"야후코리아",
			"chol.com.com"=>"천리안"
		);
		reset($emailArray);

		## 전화번호
		$telArray=array("02","031","032","033","041","042","043","051","052","053","054","055","061","062","063","064","070");
		reset($telArray);

		## 휴대전화
		$hpArray=array("010","011","016","017","018","019");
		reset($hpArray);

		## 연락처
		$phoneArray=array("010","011","016","017","018","019","02","031","032","033","041","042","043","051","052","053","054","055","061","062","063","064","070");
		reset($phoneArray);

		## 게시판권한
		$bbsAuthArray=array(
			"1"=>"비회원",
			"2"=>"회원",
			"3"=>"관리자"
		);
		reset($bbsAuthArray);

		## 게시판형태
		$bbsTypeArray=array(
			"1"=>array("일반게시판","list"),
			"2"=>array("갤러리형","gallery"),
			"3"=>array("온라인문의","inquiry"),
			"4"=>array("FAQ게시판","faq")
		);
		reset($bbsTypeArray);

		## 게시판 스킨종류
		$bbsSkinArray=array(
			"1"=>"skin1",
			"2"=>"skin2",
			"3"=>"skin3",
			"4"=>"skin4",
			"5"=>"skin5"
		);
		reset($bbsSkinArray);

		## 게시판권한
		$bbsAuthArray=array(
			"1"=>"비회원",
			"2"=>"회원",
			"3"=>"관리자"
		);
		reset($bbsAuthArray);

		## 회원가입승인
		$joinLevelArray=array(
			"1"=>"승인없이 바로 가입",
			"2"=>"관리자 인증 후 가입 "
		);
		reset($joinLevelArray);


		/* ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
			┃ 커리어 패스																																										 ┃
			┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛*/

		## 커리어패스 종류
		$careerTypeArray=array(
			"1"=>"나이",
			"2"=>"계열",
			"3"=>"전공",
			"4"=>"직종",
			"5"=>"고용형태",
			"6"=>"근무지"
		);
		reset($careerTypeArray);

		## 나이
		$careerPathArray1=array(
			"1"=>"10대",
			"2"=>"20대",
			"3"=>"30대",
			"4"=>"40대",
			"5"=>"50대",
			"6"=>"60대",
			"7"=>"기타"
		);
		reset($careerPathArray1);

		## 계열
		$careerPathArray2=array(
			"1"=>"인문계열",
			"2"=>"공학계열",
			"3"=>"자연계열",
			"4"=>"의약계열",
			"5"=>"교육계열",
			"6"=>"사회계열",
			"7"=>"예체능"
		);
		reset($careerPathArray2);

		## 전공
		$careerPathArray3=array(
			"101"=>"고고학과",
			"102"=>"국어국문학과",
			"103"=>"국제문화정보학과",
			"104"=>"기독교학과",
			"105"=>"독서문화콘텐츠과",
			"106"=>"독일관련학과",
			"107"=>"러시아관련학과",
			"108"=>"문예창작과",
			"109"=>"문헌정보과",
			"110"=>"문화재관련학과",
			"111"=>"문화콘텐츠학과",
			"112"=>"미국학과",
			"113"=>"민속학과",
			"114"=>"박물관과",
			"115"=>"북한학과",
			"116"=>"불교학과",
			"117"=>"불어불문학과",
			"118"=>"사학과",
			"119"=>"선교복지상담과",
			"120"=>"선교과",
			"121"=>"스페인어과",
			"122"=>"신학과",
			"123"=>"심리학과",
			"124"=>"아랍어학과",
			"125"=>"아시아어학과",
			"126"=>"아프리카어학과",
			"127"=>"언어과학과",
			"128"=>"영어관련학과",
			"129"=>"유럽관련 학과",
			"130"=>"윤리학과",
			"131"=>"이탈리아어학과",
			"132"=>"인도어학과",
			"133"=>"인류학과",
			"134"=>"인문학부",
			"135"=>"일본관련학과",
			"136"=>"종교학과",
			"137"=>"중국관련학과",
			"138"=>"지역학과",
			"139"=>"철학과",
			"140"=>"청소년문화과",
			"141"=>"태국어과",
			"142"=>"터키어학과",
			"143"=>"통번역학과",
			"144"=>"포르투갈어과",
			"145"=>"폴란드어과",

			"201"=>"CAD 응용학과",
			"202"=>"건설관련학과",
			"203"=>"건축관련학과",
			"204"=>"게임공학과",
			"205"=>"고분자공학과",
			"206"=>"공업화학과",
			"207"=>"광학공학과",
			"208"=>"교통공학과",
			"209"=>"국방기술학과",
			"210"=>"금속공학학과",
			"211"=>"금형설계과",
			"212"=>"기계관련학과",
			"213"=>"냉동공조공학과",
			"214"=>"도시계획관련학과",
			"215"=>"디지털관련학과",
			"216"=>"멀티미디어학과",
			"217"=>"메가트로닉스과",
			"218"=>"물류시스템공학과",
			"219"=>"반도체학과",
			"220"=>"산업 관련학과",
			"221"=>"섬유공학과",
			"222"=>"세라믹공학과",
			"223"=>"소방관련학과",
			"224"=>"소프트웨어공학과",
			"225"=>"스마트폰과",
			"226"=>"시스템 관련학과",
			"227"=>"신발패션산업과",
			"228"=>"신소재 관련학과",
			"229"=>"안경광학과",
			"230"=>"에너지자원공학과",
			"231"=>"영상콘텐츠과",
			"232"=>"원자력공학과",
			"233"=>"인쇄관련학과",
			"234"=>"인터넷정보과",
			"235"=>"임산공학과",
			"236"=>"자동차공학과",
			"237"=>"자동차과",
			"238"=>"자동차정비과",
			"239"=>"재료 관련학과",
			"240"=>"전기 관련학과",
			"241"=>"전산과",
			"242"=>"전자공학과",
			"243"=>"전파공학과",
			"244"=>"정보통신공학과",
			"245"=>"정보통신과",
			"246"=>"제어계측공학과",
			"247"=>"제지공학과",
			"248"=>"제철금속과",
			"249"=>"조경학과",
			"250"=>"조선공학과",
			"251"=>"철도관련학과",
			"252"=>"출판미디어과",
			"253"=>"컴퓨터 관련학과",
			"254"=>"토목공학과",
			"255"=>"화학 관련과",
			"256"=>"특수장비과",
			"257"=>"항공 관련과",
			"258"=>"해양 관련과",

			"301"=>"가정학과",
			"302"=>"나노공학과",
			"303"=>"농공학과",
			"304"=>"농생물학과",
			"305"=>"대기과학과",
			"306"=>"동물자원학과",
			"307"=>"물리학과",
			"308"=>"바이오생명정보과",
			"309"=>"보건환경과",
			"310"=>"산림자원학과",
			"311"=>"생명 관련학과",
			"312"=>"생물 관련학과",
			"313"=>"생화학과",
			"314"=>"수학과",
			"315"=>"식물자원학과",
			"316"=>"식품관련학과",
			"317"=>"애완동물과",
			"318"=>"외식조리과",
			"319"=>"우주과학과",
			"320"=>"원예학과",
			"321"=>"유전공학과",
			"322"=>"의류 관련학과",
			"323"=>"인터넷정보학과",
			"324"=>"임학과",
			"325"=>"자원동물산업과",
			"326"=>"전통 관련 학과",
			"327"=>"정밀화학과",
			"328"=>"정보보호학과",
			"329"=>"제과제빵과",
			"330"=>"조리과학과",
			"331"=>"지구관련학과",
			"332"=>"지리학과",
			"333"=>"지적학과",
			"334"=>"지질학과",
			"335"=>"지형정보과",
			"336"=>"천문학과",
			"337"=>"축산학과",
			"338"=>"통계학과",
			"338"=>"한방학과",
			"338"=>"호텔조리과",
			"340"=>"화학관련학과",
			"341"=>"환경 관련학과",

			"401"=>"간호학과",
			"402"=>"건강관리학과",
			"403"=>"공중보건학과",
			"404"=>"물리치료과",
			"405"=>"방사선학과",
			"406"=>"보건관련학과",
			"407"=>"수의학과",
			"408"=>"스포츠의학과",
			"409"=>"약학부",
			"410"=>"언어치료관련학과",
			"411"=>"예술치료학과",
			"412"=>"유아특수재활과",
			"413"=>"응급구조학과",
			"414"=>"의료보장구과",
			"415"=>"의료정보관련학과",
			"416"=>"의무행정과",
			"417"=>"의예과",
			"418"=>"의용공학과",
			"419"=>"임상병리학과",
			"420"=>"작업치료학과",
			"421"=>"재활학과",
			"422"=>"제약공학과",
			"423"=>"치기공학과",
			"424"=>"치위생 관련과",
			"425"=>"치의예과",
			"426"=>"한약학과",
			"427"=>"한의예과",
			"428"=>"환경보건학과",

			"501"=>"가정교육과",
			"502"=>"과학교육과",
			"503"=>"교육학 관련학과",
			"504"=>"국어교육과",
			"505"=>"기술교육과",
			"506"=>"농업교육과",
			"507"=>"독일어교육과",
			"508"=>"물리교육과",
			"509"=>"미술교육과",
			"510"=>"불어교육과",
			"511"=>"사회교육학과",
			"512"=>"생물교육과",
			"513"=>"수학교육과",
			"514"=>"수해양산업교육과",
			"515"=>"아동교육과",
			"516"=>"역사교육과",
			"517"=>"영어교육과",
			"518"=>"유아교육과",
			"519"=>"윤리교육과",
			"520"=>"일반사회교육과",
			"521"=>"일어교육과",
			"522"=>"전기공학교육과",
			"523"=>"종교교육과",
			"524"=>"지구과학교육과",
			"525"=>"지리교육과",
			"526"=>"체육교육과",
			"527"=>"초등교육과",
			"528"=>"컴퓨터교육과",
			"529"=>"특수교육학과",
			"530"=>"한문교육과",
			"531"=>"화학교육과",
			"532"=>"환경교육과",

			"601"=>"e-비즈니스학과",
			"602"=>"가족복지과",
			"603"=>"건강관리과",
			"604"=>"경영학과",
			"605"=>"경영회계정보과",
			"606"=>"경제학과",
			"607"=>"경찰행정학과",
			"608"=>"경호스포츠과",
			"609"=>"관광 관련학과",
			"610"=>"광고 관련학과",
			"611"=>"교양과",
			"612"=>"국제경영 및 통상학과",
			"613"=>"국제관계학과",
			"614"=>"국제법무학과",
			"615"=>"군사학과",
			"616"=>"금융관련학과",
			"617"=>"노인 관련학과",
			"618"=>"농업 관련학과",
			"619"=>"마케팅정보과",
			"620"=>"무역학과",
			"621"=>"문화관광과",
			"622"=>"미디어학과",
			"623"=>"법학 관련학과",
			"624"=>"벤처창업학과",
			"625"=>"보건행정과",
			"626"=>"부동산관련학과",
			"627"=>"부사관과",
			"628"=>"비서행정학과",
			"629"=>"사무정보과",
			"630"=>"사회복지학과",
			"631"=>"사회학과",
			"632"=>"언론홍보학과",
			"633"=>"연예매니지먼트과",
			"634"=>"외식산업학과",
			"635"=>"유통학과",
			"636"=>"인터넷방송과",
			"637"=>"장례지도과",
			"638"=>"전자상거래학과",
			"639"=>"정치외교학과",
			"640"=>"지방행정과",

			"701"=>"경호학과",
			"702"=>"공업디자인학과",
			"703"=>"공연제작과",
			"704"=>"공예 관련학과",
			"705"=>"관현학과",
			"706"=>"광고디자인학과",
			"707"=>"교회종교음악과",
			"708"=>"국악학과",
			"709"=>"금속공예과",
			"710"=>"기악과",
			"711"=>"대중음악과",
			"712"=>"댄스스포츠학과",
			"713"=>"도자기공예학과",
			"714"=>"동양화과",
			"715"=>"디지털디자인과",
			"716"=>"레저스포츠과",
			"717"=>"레크레이션학과",
			"718"=>"만화창작과",
			"719"=>"메이크업아티스트과",
			"720"=>"모델과",
			"721"=>"목조형가구학과",
			"722"=>"무도학과",
			"723"=>"무용과",
			"724"=>"뮤지컬과",
			"725"=>"미술학과",
			"726"=>"미용과",
			"727"=>"방송제작 관련학과",
			"728"=>"보석감정과",
			"729"=>"뷰티미용과",
			"730"=>"사진 관련학과",
			"731"=>"사회체육학과",
			"732"=>"산업디자인과",
			"733"=>"서양화과",
			"734"=>"섬유디자인과",
			"735"=>"성악과",
			"736"=>"스포츠 관련학과",
			"737"=>"시각디자인과",
			"738"=>"실내디자인과",
			"739"=>"실용미술과",
			"740"=>"실용음악과",
			"741"=>"연극영화과",
			"742"=>"연극학과",
			"743"=>"연예연기과",
			"744"=>"영상멀티미디어과",
			"745"=>"영상미술학과",
			"746"=>"영상제작과",
			"747"=>"영화과",
			"748"=>"예술치료과",
			"749"=>"웹그래픽디자인과",
			"750"=>"음악 관련학과",
			"751"=>"음향제작과",
			"752"=>"의상디자인과",
			"753"=>"이벤트과",
			"754"=>"전통예술과",
			"755"=>"제품디자인과",
			"756"=>"조소학과",
			"757"=>"체육학과",
			"758"=>"컬러리스트과",
			"759"=>"컴퓨터그래픽과",
			"760"=>"컴퓨터디자인과",
			"761"=>"태권도과",
			"762"=>"판화과",
			"763"=>"패션디자인과",
			"764"=>"피부미용과"
		);
		reset($careerPathArray3);

		## 전공
		$careerMajorArray=array(
			"1"=>array(
					"101"=>"고고학과",
					"102"=>"국어국문학과",
					"103"=>"국제문화정보학과",
					"104"=>"기독교학과",
					"105"=>"독서문화콘텐츠과",
					"106"=>"독일관련학과",
					"107"=>"러시아관련학과",
					"108"=>"문예창작과",
					"109"=>"문헌정보과",
					"110"=>"문화재관련학과",
					"111"=>"문화콘텐츠학과",
					"112"=>"미국학과",
					"113"=>"민속학과",
					"114"=>"박물관과",
					"115"=>"북한학과",
					"116"=>"불교학과",
					"117"=>"불어불문학과",
					"118"=>"사학과",
					"119"=>"선교복지상담과",
					"120"=>"선교과",
					"121"=>"스페인어과",
					"122"=>"신학과",
					"123"=>"심리학과",
					"124"=>"아랍어학과",
					"125"=>"아시아어학과",
					"126"=>"아프리카어학과",
					"127"=>"언어과학과",
					"128"=>"영어관련학과",
					"129"=>"유럽관련 학과",
					"130"=>"윤리학과",
					"131"=>"이탈리아어학과",
					"132"=>"인도어학과",
					"133"=>"인류학과",
					"134"=>"인문학부",
					"135"=>"일본관련학과",
					"136"=>"종교학과",
					"137"=>"중국관련학과",
					"138"=>"지역학과",
					"139"=>"철학과",
					"140"=>"청소년문화과",
					"141"=>"태국어과",
					"142"=>"터키어학과",
					"143"=>"통번역학과",
					"144"=>"포르투갈어과",
					"145"=>"폴란드어과"
					),
			"2"=>array(
					"201"=>"CAD 응용학과",
					"202"=>"건설관련학과",
					"203"=>"건축관련학과",
					"204"=>"게임공학과",
					"205"=>"고분자공학과",
					"206"=>"공업화학과",
					"207"=>"광학공학과",
					"208"=>"교통공학과",
					"209"=>"국방기술학과",
					"210"=>"금속공학학과",
					"211"=>"금형설계과",
					"212"=>"기계관련학과",
					"213"=>"냉동공조공학과",
					"214"=>"도시계획관련학과",
					"215"=>"디지털관련학과",
					"216"=>"멀티미디어학과",
					"217"=>"메가트로닉스과",
					"218"=>"물류시스템공학과",
					"219"=>"반도체학과",
					"220"=>"산업 관련학과",
					"221"=>"섬유공학과",
					"222"=>"세라믹공학과",
					"223"=>"소방관련학과",
					"224"=>"소프트웨어공학과",
					"225"=>"스마트폰과",
					"226"=>"시스템 관련학과",
					"227"=>"신발패션산업과",
					"228"=>"신소재 관련학과",
					"229"=>"안경광학과",
					"230"=>"에너지자원공학과",
					"231"=>"영상콘텐츠과",
					"232"=>"원자력공학과",
					"233"=>"인쇄관련학과",
					"234"=>"인터넷정보과",
					"235"=>"임산공학과",
					"236"=>"자동차공학과",
					"237"=>"자동차과",
					"238"=>"자동차정비과",
					"239"=>"재료 관련학과",
					"240"=>"전기 관련학과",
					"241"=>"전산과",
					"242"=>"전자공학과",
					"243"=>"전파공학과",
					"244"=>"정보통신공학과",
					"245"=>"정보통신과",
					"246"=>"제어계측공학과",
					"247"=>"제지공학과",
					"248"=>"제철금속과",
					"249"=>"조경학과",
					"250"=>"조선공학과",
					"251"=>"철도관련학과",
					"252"=>"출판미디어과",
					"253"=>"컴퓨터 관련학과",
					"254"=>"토목공학과",
					"255"=>"화학 관련과",
					"256"=>"특수장비과",
					"257"=>"항공 관련과",
					"258"=>"해양 관련과"
					),
			"3"=>array(
					"301"=>"가정학과",
					"302"=>"나노공학과",
					"303"=>"농공학과",
					"304"=>"농생물학과",
					"305"=>"대기과학과",
					"306"=>"동물자원학과",
					"307"=>"물리학과",
					"308"=>"바이오생명정보과",
					"309"=>"보건환경과",
					"310"=>"산림자원학과",
					"311"=>"생명 관련학과",
					"312"=>"생물 관련학과",
					"313"=>"생화학과",
					"314"=>"수학과",
					"315"=>"식물자원학과",
					"316"=>"식품관련학과",
					"317"=>"애완동물과",
					"318"=>"외식조리과",
					"319"=>"우주과학과",
					"320"=>"원예학과",
					"321"=>"유전공학과",
					"322"=>"의류 관련학과",
					"323"=>"인터넷정보학과",
					"324"=>"임학과",
					"325"=>"자원동물산업과",
					"326"=>"전통 관련 학과",
					"327"=>"정밀화학과",
					"328"=>"정보보호학과",
					"329"=>"제과제빵과",
					"330"=>"조리과학과",
					"331"=>"지구관련학과",
					"332"=>"지리학과",
					"333"=>"지적학과",
					"334"=>"지질학과",
					"335"=>"지형정보과",
					"336"=>"천문학과",
					"337"=>"축산학과",
					"338"=>"통계학과",
					"338"=>"한방학과",
					"338"=>"호텔조리과",
					"340"=>"화학관련학과",
					"341"=>"환경 관련학과"
					),
			"4"=>array(

					"401"=>"간호학과",
					"402"=>"건강관리학과",
					"403"=>"공중보건학과",
					"404"=>"물리치료과",
					"405"=>"방사선학과",
					"406"=>"보건관련학과",
					"407"=>"수의학과",
					"408"=>"스포츠의학과",
					"409"=>"약학부",
					"410"=>"언어치료관련학과",
					"411"=>"예술치료학과",
					"412"=>"유아특수재활과",
					"413"=>"응급구조학과",
					"414"=>"의료보장구과",
					"415"=>"의료정보관련학과",
					"416"=>"의무행정과",
					"417"=>"의예과",
					"418"=>"의용공학과",
					"419"=>"임상병리학과",
					"420"=>"작업치료학과",
					"421"=>"재활학과",
					"422"=>"제약공학과",
					"423"=>"치기공학과",
					"424"=>"치위생 관련과",
					"425"=>"치의예과",
					"426"=>"한약학과",
					"427"=>"한의예과",
					"428"=>"환경보건학과"
					),
			"5"=>array(
					"501"=>"가정교육과",
					"502"=>"과학교육과",
					"503"=>"교육학 관련학과",
					"504"=>"국어교육과",
					"505"=>"기술교육과",
					"506"=>"농업교육과",
					"507"=>"독일어교육과",
					"508"=>"물리교육과",
					"509"=>"미술교육과",
					"510"=>"불어교육과",
					"511"=>"사회교육학과",
					"512"=>"생물교육과",
					"513"=>"수학교육과",
					"514"=>"수해양산업교육과",
					"515"=>"아동교육과",
					"516"=>"역사교육과",
					"517"=>"영어교육과",
					"518"=>"유아교육과",
					"519"=>"윤리교육과",
					"520"=>"일반사회교육과",
					"521"=>"일어교육과",
					"522"=>"전기공학교육과",
					"523"=>"종교교육과",
					"524"=>"지구과학교육과",
					"525"=>"지리교육과",
					"526"=>"체육교육과",
					"527"=>"초등교육과",
					"528"=>"컴퓨터교육과",
					"529"=>"특수교육학과",
					"530"=>"한문교육과",
					"531"=>"화학교육과",
					"532"=>"환경교육과"

					),
			"6"=>array(
					"601"=>"e-비즈니스학과",
					"602"=>"가족복지과",
					"603"=>"건강관리과",
					"604"=>"경영학과",
					"605"=>"경영회계정보과",
					"606"=>"경제학과",
					"607"=>"경찰행정학과",
					"608"=>"경호스포츠과",
					"609"=>"관광 관련학과",
					"610"=>"광고 관련학과",
					"611"=>"교양과",
					"612"=>"국제경영 및 통상학과",
					"613"=>"국제관계학과",
					"614"=>"국제법무학과",
					"615"=>"군사학과",
					"616"=>"금융관련학과",
					"617"=>"노인 관련학과",
					"618"=>"농업 관련학과",
					"619"=>"마케팅정보과",
					"620"=>"무역학과",
					"621"=>"문화관광과",
					"622"=>"미디어학과",
					"623"=>"법학 관련학과",
					"624"=>"벤처창업학과",
					"625"=>"보건행정과",
					"626"=>"부동산관련학과",
					"627"=>"부사관과",
					"628"=>"비서행정학과",
					"629"=>"사무정보과",
					"630"=>"사회복지학과",
					"631"=>"사회학과",
					"632"=>"언론홍보학과",
					"633"=>"연예매니지먼트과",
					"634"=>"외식산업학과",
					"635"=>"유통학과",
					"636"=>"인터넷방송과",
					"637"=>"장례지도과",
					"638"=>"전자상거래학과",
					"639"=>"정치외교학과",
					"640"=>"지방행정과"
					),
			"7"=>array(
					"701"=>"경호학과",
					"702"=>"공업디자인학과",
					"703"=>"공연제작과",
					"704"=>"공예 관련학과",
					"705"=>"관현학과",
					"706"=>"광고디자인학과",
					"707"=>"교회종교음악과",
					"708"=>"국악학과",
					"709"=>"금속공예과",
					"710"=>"기악과",
					"711"=>"대중음악과",
					"712"=>"댄스스포츠학과",
					"713"=>"도자기공예학과",
					"714"=>"동양화과",
					"715"=>"디지털디자인과",
					"716"=>"레저스포츠과",
					"717"=>"레크레이션학과",
					"718"=>"만화창작과",
					"719"=>"메이크업아티스트과",
					"720"=>"모델과",
					"721"=>"목조형가구학과",
					"722"=>"무도학과",
					"723"=>"무용과",
					"724"=>"뮤지컬과",
					"725"=>"미술학과",
					"726"=>"미용과",
					"727"=>"방송제작 관련학과",
					"728"=>"보석감정과",
					"729"=>"뷰티미용과",
					"730"=>"사진 관련학과",
					"731"=>"사회체육학과",
					"732"=>"산업디자인과",
					"733"=>"서양화과",
					"734"=>"섬유디자인과",
					"735"=>"성악과",
					"736"=>"스포츠 관련학과",
					"737"=>"시각디자인과",
					"738"=>"실내디자인과",
					"739"=>"실용미술과",
					"740"=>"실용음악과",
					"741"=>"연극영화과",
					"742"=>"연극학과",
					"743"=>"연예연기과",
					"744"=>"영상멀티미디어과",
					"745"=>"영상미술학과",
					"746"=>"영상제작과",
					"747"=>"영화과",
					"748"=>"예술치료과",
					"749"=>"웹그래픽디자인과",
					"750"=>"음악 관련학과",
					"751"=>"음향제작과",
					"752"=>"의상디자인과",
					"753"=>"이벤트과",
					"754"=>"전통예술과",
					"755"=>"제품디자인과",
					"756"=>"조소학과",
					"757"=>"체육학과",
					"758"=>"컬러리스트과",
					"759"=>"컴퓨터그래픽과",
					"760"=>"컴퓨터디자인과",
					"761"=>"태권도과",
					"762"=>"판화과",
					"763"=>"패션디자인과",
					"764"=>"피부미용과"
					)
		);
		reset($careerMajorArray);

		## 직종
		$careerPathArray4=array(
			"1"=>"경영·사무",
			"2"=>"금융·컨설팅",
			"3"=>"영업·마케팅",
			"4"=>"생산·제조업",
			"5"=>"IT·인터넷",
			"6"=>"전문직",
			"7"=>"교육",
			"8"=>"미디어",
			"9"=>"특수계층·공공",
			"10"=>"건설·건축",
			"11"=>"유통·무역",
			"12"=>"서비스",
			"13"=>"디자인",
			"14"=>"의료"
		);
		reset($careerPathArray4);

		## 고용형태
		$careerPathArray5=array(
			"1"=>"오너/파트너",
			"2"=>"정규직",
			"3"=>"계약직",
			"4"=>"인턴",
			"5"=>"파트타임"
		);
		reset($careerPathArray5);

		## 근무지
		$careerPathArray6=array(
			"1"=>"국내대기업",
			"2"=>"외국계기업",
			"3"=>"중소기업",
			"4"=>"병원",
			"5"=>"학교·학원·대학교",
			"6"=>"일반은행",
			"7"=>"증권사",
			"8"=>"투자은행",
			"9"=>"경영컨설팅",
			"10"=>"벤처기업",
			"11"=>"개인사업체",
			"12"=>"벤처캐피탈·전문투자자",
			"13"=>"전문기관 (로펌,회계법인등)",
			"14"=>"정부기관",
			"15"=>"방송관련·미디어"
		);
		reset($careerPathArray6);


		/* ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
			┃ 마이 프로필																																										 ┃
			┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛*/

		## 지역
		$profileAreaArray=array(
			"1"=>"서울",
			"2"=>"경기",
			"3"=>"대전",
			"4"=>"대구",
			"5"=>"경북",
			"6"=>"충북"
		);
		reset($profileAreaArray);

		## 학력
		$profileEducationArray=array(
			"1"=>"고등학교 졸업",
			"2"=>"2*3 년제 대학 졸업",
			"3"=>"4년제 대학교 졸업 - 호텔 /관광 경영학 전공",
			"4"=>"4년제 대학교 졸업",
			"5"=>"요리학교 졸업",
			"6"=>"대학원 졸업",
			"7"=>"박사"
		);
		reset($profileEducationArray);

		## 직업
		$profileJobArray=array(
			"1"=>"고등학생",
			"2"=>"대학생",
			"3"=>"취업준비생",
			"4"=>"직장인",
		);
		reset($profileJobArray);

		## 프로필 백그라운드
		$profileStyleArray=array(
			"left"=>array("0%","0%","no-repeat","auto"),
			"center"=>array("50%","0%","no-repeat","auto"),
			"right"=>array("100%","0%","no-repeat","auto"),
			"tile"=>array("0%","0%","repeat","auto"),
			"fit"=>array("50%","50%","no-repeat","auto"),
			"full"=>array("50%","0%","no-repeat","100%")
		);
		reset($profileStyleArray);

		## 프로필 폰트
		$profileFontArray=array(
			"THEBlackjackM"=>"The블랙잭 M",
			"RixToyShadow"=>"Rix토이쉐도우",
			"RixSGo B"=>"Rix고딕 B",
			"'HeummForest142'"=>"헤움숲 142",
			"RixPhilB"=>"Rix필 B",
			"HeummPinwheel172"=>"헤움 바람개비",
			"KoreanMJM"=>"a신명조",
			"RixLemonade M"=>"Rix레모네이드 M",
			"1HoonSlimskinny L"=>"훈 슬림스키니",

		);
		reset($profileFontArray);
?>